tomasmcguinness/matter-esp32-controller/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_IDF_TARGET_ESP32S3=y

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_HOOK_IP6_ROUTE_DEFAULT=y
CONFIG_LWIP_HOOK_ND6_GET_GW_DEFAULT=y
CONFIG_LWIP_IPV6_NUM_ADDRESSES=12
CONFIG_LWIP_IPV6_ND6_NUM_ROUTERS=10
CONFIG_LWIP_IPV6_ND6_ROUTE_INFO_OPTION_SUPPORT=y
CONFIG_LWIP_IPV6_ND6_NUM_ROUTE_INFO=10

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

# Increase stack sizes for Matter
CONFIG_CHIP_TASK_STACK_SIZE=15360
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240

# Increase UDP endpoints for commissioner
CONFIG_NUM_UDP_ENDPOINTS=16

# We're not a device
CONFIG_ESP_MATTER_ENABLE_MATTER_SERVER=n

# Enable Controller
CONFIG_ENABLE_CHIP_CONTROLLER_BUILD=y
CONFIG_ESP_MATTER_CONTROLLER_ENABLE=y

# Enable Commissioning
CONFIG_ESP_MATTER_COMMISSIONER_ENABLE=y

# Enable HKDF in mbedtls (required by Matter)
CONFIG_MBEDTLS_HKDF_C=y

# Thread 1.4 Credential Sharing engine: MeshCoP commissioner runs DTLS with the
# EC-JPAKE (TLS-ECJPAKE-WITH-AES-128-CCM-8) key exchange against the Border Agent.
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_ECJPAKE_C=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECJPAKE=y

# Enable chip shell for debugging
CONFIG_ENABLE_CHIP_SHELL=y
CONFIG_ESP_MATTER_CONSOLE_TASK_STACK=4096
CONFIG_CHIP_SHELL_CMD_LINE_BUF_MAX_LENGTH=512

# Disable Wi-Fi and Thread explicitly
CONFIG_ENABLE_WIFI_STATION=n
CONFIG_ENABLE_MATTER_OVER_THREAD=n

CONFIG_USE_MINIMAL_MDNS=n

# Disable BLE commissioning — not needed for on-network (Ethernet) commissioning
CONFIG_BT_ENABLED=n
CONFIG_ENABLE_CHIPOBLE=n

# Enable WebSocket support in the HTTP server
CONFIG_HTTPD_WS_SUPPORT=y

# Enable Ethernet
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETH_SPI_ETHERNET_W5500=y

# Switch off telemetry and commissioning as this is a controller.
CONFIG_WIFI_NETWORK_COMMISSIONING_DRIVER=n
CONFIG_ETHERNET_NETWORK_COMMISSIONING_DRIVER=n
CONFIG_ENABLE_WIFI_TELEMETRY=n
CONFIG_ETH_USE_OPENETH=n
CONFIG_ENABLE_ETHERNET_TELEMETRY=n

# disable softap by default
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n